import ImagesList from "../Components/ImagesList";

const AboutUs = () => {
  return (
    <div
      className="p-6 w-full max-w-4xl mx-auto bg-white rounded-lg shadow-lg mb-6"
      style={{ direction: "rtl" }}
    >
      <ImagesList />
      <h1 className="text-xl font-semibold text-gray-800 mb-4">עלינו</h1>
      <p className="text-gray-600 text-lg mb-5">
        אנחנו רון חביב ויוהן, שלושה לוחמים משוחררים ששירתו במלחמה האחרונה ברצועת
        עזה, וכיום סטודנטים בקורס לפיתוח תוכנה במכללת IITC בישראל. במסגרת האקתון
        שעסק במעורבות חברתית, שילבנו את הניסיון האישי שלנו יחד עם היכולות
        הטכניות שרכשנו כדי ליצור אפליקציה שנועדה לתמוך באנשים המתמודדים עם פוסט
        טראומה (PTSD). הפרויקט שלנו הוא תגובה לצורך הגובר בישראל בימים מאתגרים
        אלה. בעקבות אירועי ה-7 באוקטובר והמצב הביטחוני הנוכחי, רבים – חיילים
        ואזרחים כאחד – מתמודדים עם ההשלכות של אירועים טראומטיים ומשני חיים.
        זיהינו את החשיבות הקריטית בהנגשת תמיכה מקצועית, אמפתית ואנונימית לאלו
        הנמצאים במאבק הזה. האפליקציה שלנו מספקת מרחב בטוח לצ'אטים אנונימיים עם
        אנשי מקצוע או עם אנשים שעברו חוויות דומות, גישה למידע מקצועי אמין וכלים
        לבניית יומן פעילויות אישי. המטרה שלנו היא לעזור לאנשים לנקוט בצעדים
        משמעותיים בדרך להחלמה, תוך יצירת קהילה של הבנה ותמיכה. יחד, אנחנו שואפים
        לתרום לחוסן ולהתאוששות של החברה הישראלית.
      </p>
    </div>
  );
};

export default AboutUs;
